Repository: AviSheth/E-Book-Reader-App
Catalog: lib/l10n/app_*.arb
Languages: gu

source: About
gu: વધુ જાણો

# aboutDialogContent
source: E-Book Reader is a modern and lightweight app built with Flutter, designed to give you a smooth and distraction-free reading experience. ðŸ“š Key Features: - Read ePub and PDF files - Dark mode support - Bookmark and resume where you left off - Simple and elegant interface Whether youâ€™re reading for fun or learning, E-Book Reader aims to be your go-to app for all your digital books.
gu: E-Book Reader એ એક આધુનિક અને હળવા એપ્લિકેશન છે જે Flutter સાથે બનાવવામાં આવી છે, જે તમને એક નરમ અને વિક્ષેપરહિત વાંચનનો અનુભવ આપે છે। 📚 મુખ્ય લક્ષણો: - ePub અને PDF ફાઇલો વાંચો - ડાર્ક મોડી સપોર્ટ - બુકમાર્ક અને જ્યાંથી રોકાયું ત્યાંથી શરૂ કરો - સરળ અને સૌંદર્યપૂર્ણ ઇન્ટરફેસ ચાહે તમે મઝા માટે વાંચતા હોવ અથવા શીખતા હોવ, E-Book Reader તમારી ડિજીટલ પુસ્તકો માટે એ જવા જેવી એપ્લિકેશન બનવાનું લક્ષ્ય રાખે છે।

source: Add Ebook
gu: ઈબુક ઉમેરો

# addEbookButton
source: Add Ebook
gu: ઈબુક ઉમેરો

source: Admin Dashboard
gu: એડમિન ડેશબોર્ડ

# adminEmail
source: admin
gu: એડમિન

# adminPassword
source: admin
gu: એડમિન

# alreadyHaveAccount
source: Already have an account?
gu: જો તમે પહેલેથી જ એકાઉન્ટ ધરાવ છો તો?

source: Author
gu: લેખક

source: Back to Login
gu: લોગિન પર પાછા જાઓ

source: Book ID
gu: પુસ્તક આઈડી

source: Book URL
gu: પુસ્તક URL

source: Cancel
gu: રદ કરો

source: Category
gu: વર્ગ

# categoryRequired
source: Category is required
gu: વર્ગ જરૂરી છે

# chooseSubscription
source: Choose a Subscription Plan
gu: સબ્સક્રિપ્શન યોજના પસંદ કરો

source: Close
gu: બંધ કરો

source: Contact
gu: સંપર્ક

# contactEmpty
source: Please enter your contact number
gu: કૃપા કરીને તમારો સંપર્ક નંબર દાખલ કરો

# contactInvalid
source: Please enter a valid contact number
gu: કૃપા કરીને માન્ય સંપર્ક નંબર દાખલ કરો

source: Cover Image URL
gu: કવર છબી URL

source: Create Account
gu: ખાતું બનાવો

source: Dark Mode
gu: ડાર્ક મોડી

source: Delete
gu: હટાવો

# deleteConfirmation
source: Are you sure you want to delete this ebook?
gu: શું તમે ખરેખર આ ઇબુકને મિટાવવા માંગો છો?

source: Delete Ebook
gu: ઈબુક હટાવો

source: Description
gu: વર્ણન

source: Download URL
gu: ડાઉનલોડ URL

source: Ebook Manage Page
gu: ઇબુક મેનેજ પેજ

source: Edit Ebook
gu: ઇબુક સંપાદિત કરો

source: Email
gu: ઈમેઇલ

# emailEmpty
source: Please enter your email
gu: કૃપા કરીને તમારું ઈમેઇલ દાખલ કરો

# emailInvalid
source: Enter a valid email
gu: માન્ય ઈમેઇલ દાખલ કરો

# emailLabel
source: Email
gu: ઈમેઇલ

source: English
gu: અંગ્રેજી

source: Error updating profile
gu: પ્રોફાઈલ અપડેટ કરતી વખતે ભૂલ

# failedToLoadPdf
source: Failed to load PDF: {error}
gu: PDF લોડ કરવામાં નિષ્ફળ: {error}

source: Forgot Password?
gu: પાસવર્ડ ભૂલ્યા છો?

# french
source: FranÃ§ais
gu: ફ્રેંચ

source: Full Name
gu: પૂરૂં નામ

# fullNameLabel
source: Full Name
gu: પૂરૂં નામ

source: German
gu: જર્મન

source: Gujarati
gu: ગુજરાતી

source: Hindi
gu: હિન્દી

# invalidCredentials
source: Invalid email or password
gu: ઈમેઇલ અથવા પાસવર્ડ ખોટો છે

# invalidPhone
source: Enter a valid phone number
gu: માન્ય ફોન નંબર દાખલ કરો

source: Language
gu: ભાષા

# languageRequired
source: Language is required
gu: ભાષા જરૂરી છે

# licenseText
source: This app is licensed under the MIT License. Copyright (c) [Year] [Your Name/Company Name] Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. For support or inquiries, please contact [Your Email Address] or visit [Your Website].
gu: આ એપ્લિકેશન MIT લાઇસન્સ હેઠળ લાઇસન્સ છે। કોપીરાઇટ (c) [વર્ષ] [તમારું નામ/કંપની નામ] પરવાનગી સાથે, કોઈ પણ વ્યક્તિને આ સોફ્ટવેર અને સહયોગી દસ્તાવેજ ફાઇલો ("સોફ્ટવેર") નો નકલ મેળવવાનો, વાપરવાનો, નકલ કરવાનું, બદલાવ લાવવાનું, મર્જ કરવાનું, પ્રકાશિત કરવાનું, વિતરિત કરવાનું, સબલાઇસન્સ અથવા વેચવાનો પરવાનગી આપવામાં આવે છે, અને જેમને સોફ્ટવેર આપ્યો છે તેમને આવું કરવા માટે પરવાનગી આપવામાં આવે છે, નીચેના શરતો હેઠળ: ઉપરોક્ત કોપીરાઇટ નોંધ અને આ પરવાનગીનો નોંધ તમામ નકલોમાં અથવા સોફ્ટવેરના મહત્વપૂર્ણ ભાગોમાં શામેલ કરવામાં આવશે。 સોફ્ટવેર "જેમ છે" પ્રદાન કરવામાં આવે છે, જેમાં કોઈ પણ પ્રકારની વોરંટી નહીં હોય, સ્પષ્ટ કે અનુમાનિત, જેમાં વ્યાપકતા, ખાસ હેતુ માટેની ફિટનેસ અને અવધિનો સમાવેશ થાય છે. લેખકો અથવા કોપીરાઇટ ધારક કોઈપણ દાવા, નુકસાન અથવા અન્ય જવાબદારી માટે જવાબદાર નહિ હોઈ શકે, શું તે કરાર, ટોર્ટ અથવા અન્ય રીતે, સોફ્ટવેર અથવા સોફ્ટવેરના ઉપયોગ અથવા અન્ય વ્યવહારો સાથે જોડાયેલા હોય છે.

source: Loading PDF...
gu: PDF લોડ થઈ રહ્યું છે...

# loadingUserDataError
source: Error loading user data
gu: વપરાશકર્તા ડેટા લોડ કરતી વખતે ભૂલ

source: Login
gu: લોગિન

# loginButton
source: Login
gu: લોગિન

# loginError
source: Login error: {error}
gu: લોગિન ભૂલ: {error}

source: Manage Ebooks
gu: ઇબુક્સ મેનેજ કરો

source: month
gu: મહિનો

source: Monthly Plan
gu: માસિક યોજના

# nameEmpty
source: Please enter your full name
gu: કૃપા કરીને તમારું પૂરું નામ દાખલ કરો

# nameTooLong
source: Name cannot exceed 40 characters
gu: નામ 40 અક્ષરોથી વધુ નહીં હોઈ શકે

source: New Password
gu: નવું પાસવર્ડ

# noEbooksAdded
source: No ebooks added yet.
gu: કોઈ ઇબુક્સ ઉમેર્યા નથી.

source: No users found
gu: કોઈ વપરાશકર્તાઓ મળ્યાં નથી

source: OK
gu: ઠીક છે

source: Open Source Licenses
gu: ઓપન સોર્સ લાઇસન્સ

source: Page Count
gu: પૃષ્ઠ ગણના

# pageLabel
source: Page {currentPage} of {totalPages}
gu: પૃષ્ઠ {currentPage} થી {totalPages}

source: Password
gu: પાસવર્ડ

# passwordTooShort
source: Password must be at least 6 characters
gu: પાસવર્ડ ઓછામાં ઓછા 6 અક્ષરો હોવો જોઈએ

# passwordUpdateFailed
source: Failed to update password. Please try again.
gu: પાસવર્ડ અપડેટ કરવામાં નિષ્ફળ. કૃપા કરીને ફરીથી પ્રયાસ કરો.

# passwordUpdated
source: Password updated successfully!
gu: પાસવર્ડ સફળતાપૂર્વક અપડેટ કરવામાં આવ્યો!

source: Passwords do not match
gu: પાસવર્ડ્સ મેળ ખાતા નથી

source: Payment Failed
gu: ચૂકવણી નિષ્ફળ

# paymentSuccess
source: Payment Successful!
gu: ચૂકવણી સફળ!

# pdfViewerTitle
source: PDF Viewer
gu: PDF દર્શક

# phoneNumberLabel
source: Phone Number
gu: ફોન નંબર

# pleaseEnterEmailPassword
source: Please enter both email and password
gu: કૃપા કરીને ઇમેઇલ અને પાસવર્ડ દાખલ કરો

# pleaseEnterName
source: Please enter your name
gu: કૃપા કરીને તમારું નામ દાખલ કરો

# pleaseEnterNewPassword
source: Please enter a new password
gu: કૃપા કરીને નવું પાસવર્ડ દાખલ કરો

# pleaseEnterPhone
source: Please enter your phone number
gu: કૃપા કરીને તમારો ફોન નંબર દાખલ કરો

# pleaseEnterValidEmail
source: Please enter a valid email
gu: કૃપા કરીને માન્ય ઈમેઇલ દાખલ કરો

source: Please enter your email
gu: કૃપા કરીને તમારું ઈમેઇલ દાખલ કરો

# pleaseReEnterPassword
source: Please re-enter your password
gu: કૃપા કરીને પાસવર્ડ ફરીથી દાખલ કરો

# profileUpdated
source: Profile updated successfully!
gu: પ્રોફાઈલ સફળતાપૂર્વક અપડેટ કરાઈ છે!

source: Re-Enter New Password
gu: નવી પાસવર્ડ ફરીથી દાખલ કરો

source: Refresh
gu: રીફ્રેશ

source: Registration failed!
gu: હજી નોંધણી નિષ્ફળ ગઈ!

# registrationSuccessMessage
source: Account created successfully!
gu: ખાતું સફળતાપૂર્વક બનાવાયું!

# registrationSuccessTitle
source: Success
gu: સફળતા

source: Reset Password
gu: પાસવર્ડ ફરીથી સેટ કરો

# resetPasswordButton
source: Reset Password
gu: પાસવર્ડ ફરીથી સેટ કરો

# selectLanguageTitle
source: Select language for the app
gu: એપ્લિકેશન માટે ભાષા પસંદ કરો

source: Settings
gu: સેટિંગ્સ

# settingsTitle
source: Settings
gu: સેટિંગ્સ

source: Sign Up
gu: સાઇન અપ

# signUpPrompt
source: Sign up to get started!
gu: શરૂઆત કરવા માટે સાઇન અપ કરો!

# signupPrompt
source: Don't have an account?
gu: શું તમારું ખાતું નથી?

source: Statistics
gu: આંકડાઓ

source: Subscription Plans
gu: સબ્સક્રિપ્શન યોજના

source: Title
gu: શીર્ષક

# updateButton
source: Update Profile
gu: પ્રોફાઈલ અપડેટ કરો

# updateEbookButton
source: Update Ebook
gu: ઇબુક અપડેટ કરો

# updateFailed
source: No changes made or update failed
gu: કોઈ ફેરફાર નથી અથવા અપડેટ નિષ્ફળ

# updateProfileTitle
source: Update Profile
gu: પ્રોફાઈલ અપડેટ કરો

# urlRequired
source: URL is required
gu: URL જરૂરી છે

source: User List
gu: વપરાશકર્તા યાદી

# userNotFound
source: User data not found
gu: વપરાશકર્તા ડેટા મળી નથી

source: year
gu: વર્ષ

source: Yearly Plan
gu: વાર્ષિક યોજના

source: Zoom In
gu: ઝૂમ ઇન

source: Zoom Out
gu: ઝૂમ આઉટ

source: Book Details
gu: પુસ્તક વિગતો

source: by {author}
gu: લેખક દ્વારા

# pagesCount
source: {count} pages
gu: {count} પૃષ્ઠો

source: Downloading...
gu: ડાઉનલોડ કરી રહ્યું છે...

source: Download
gu: ડાઉનલોડ

source: Read Book
gu: પુસ્તક વાંચો

source: Added to favorites
gu: પ્રિય યાદીમાં ઉમેરાયું

source: Removed from favorites
gu: પ્રિય યાદીમાંથી હટાવવામાં આવ્યું

source: Subscription Required
gu: સબ્સક્રિપ્શન જરૂરી છે

# subscribeToContinue
source: Please subscribe to continue.
gu: કૃપા કરીને આગળ વધવા માટે સબ્સક્રાઇબ કરો.

source: Subscribe Now
gu: હમણાં સબ્સક્રાઇબ કરો

source: Home
gu: હોમ

source: Explore
gu: अन्वेषण

source: Profile
gu: પ્રોફાઈલ

source: Logout
gu: લોગઆઉટ

source: Filter Options
gu: ફિલ્ટર વિકલ્પો

source: Reset Filters
gu: ફિલ્ટર્સ ફરીથી સેટ કરો

source: Apply
gu: લાગુ કરો

source: Search ebooks...
gu: ઇબુક્સ શોધો...

source: No ebooks found
gu: કોઈ ઇબુક્સ મળી નથી

source: Filter
gu: ફિલ્ટર

source: Page
gu: પૃષ્ઠ

source: Favorite Books
gu: પ્રિય પુસ્તકો

# noFavoriteBooks
source: No favorite books yet!
gu: કોઈ પ્રિય પુસ્તકો નથી!

source: Remove Favorite
gu: પ્રિય યાદીમાંથી કાઢો

# removeFavoriteConfirmation
source: Are you sure you want to remove "{title}" from favorites?
gu: શું તમે ખરેખર "{title}"ને પ્રિય યાદીમાંથી કાઢી નાખવા માંગો છો?

source: Remove
gu: હટાવ

source: Subscription Plan
gu: સબ્સ્ક્રિપ્શન યોજના

source: Expiry Date
gu: સમાપ્તિ તારીખ

source: Remove Download
gu: ડાઉનલોડ કાઢો

# removeDownloadConfirmation
source: Are you sure you want to remove the download for {title}?
gu: શું તમે આ ડાઉનલોડ ({title}) દૂર કરવાનું pકદ્વી રહ્યા છો?

source: Removed from downloads
gu: ડાઉનલોડમાંથી દૂર કરાયું

# noDownloadedBooks
source: No books downloaded yet.
gu: હજી સુધી કોઈ પુસ્તકો ડાઉનલોડ કરવામાં આવ્યા નથી.
